app/views/tasks/_form.html.erb

SELECT "projects".* FROM "projects"
---
    <%= f.label :project_id, "Select the Project for this task:" %><br>
    <%= f.collection_select :project_id, Project.all, :id, :name %>

SELECT "users".* FROM "users"
---
        <%= f.label :user_id, "Select the User for this task:" %><br>
        <%= f.collection_select :user_id, User.all, :id, :username %>