app/controllers/projects_controller.rb

INSERT INTO "projects" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "First Project"], ["created_at", "2020-06-17 21:46:30.965375"], ["updated_at", "2020-06-17 21:46:30.965375"]]
---
    def create

        @project = Project.new(project_params)
        if @project.save