app/controllers/sessions_controller.rb

    def create
        if auth_hash
            @user = User.find_or_create_by_omniauth(auth_hash)
            session[:user_id] = @user.id

            redirect_to project_path
        else
            @user = User.find_by(email: params[:user][:email])
---
SELECT "users".* FROM "users" WHERE "users"."uid" = ? LIMIT ?  [["uid", "962362200882008"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "samiylo@gmail.com"], ["LIMIT", 1]]