app/controllers/tasks_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = ?  [["user_id", 1]]
---
    def index
        if params[:user_id]
            if User.find(params[:user_id]) == current_user
                @user = User.find(params[:user_id])
                @tasks = @user.tasks
            else
                redirect_to projects_path
                flash[:notice] = "Unauthorized Access."
            end
        else
            @tasks = Task.all

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def new
        if params[:user_id]
            @user = User.find(params[:user_id])
            @task = @user.tasks.build
            @task = Task.new(user_id: @user.id)
        elsif params[:project_id]
            @project = Project.find(params[:project_id])

INSERT INTO "tasks" ("due_date", "description", "user_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["due_date", "2020-06-17 00:00:00"], ["description", "First Task"], ["user_id", 1], ["project_id", 1], ["created_at", "2020-06-17 21:46:41.036168"], ["updated_at", "2020-06-17 21:46:41.036168"]]
---
    def create
        @task = Task.new(task_params)

        if @task.save

UPDATE "tasks" SET "description" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["description", "Marins New Task "], ["updated_at", "2020-06-19 06:48:47.002343"], ["id", 2]]
---
    def update
        if @task.update(task_params)

UPDATE "tasks" SET "completed" = ?, "updated_at" = ? WHERE "tasks"."id" = ?  [["completed", 1], ["updated_at", "2020-06-18 07:24:29.239772"], ["id", 1]]
---
    def complete
        if authorized
            @task.update(completed: true)