app/models/user.rb

SELECT "users".* FROM "users" INNER JOIN "tasks" ON "tasks"."user_id" = "users"."id" INNER JOIN "projects" ON "projects"."id" = "tasks"."project_id" GROUP BY "user_id" ORDER BY COUNT(*) DESC LIMIT ?  [["LIMIT", 1]]
---
    scope :most_projects, -> {joins(:projects).group(:user_id).order("COUNT(*) DESC").first}